In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv('C:/Users/Lenovo/Desktop/SAMPLE 1.csv')

AttributeError: module 'pandas' has no attribute 'read_'

In [3]:
dataset = pd.read_csv('C:/Users/Lenovo/Desktop/SAMPLE 1.csv')

In [4]:
dataset.head()

  Number                                           Footnote
0      1  Sector and published industry breakdowns accor...
1      2  In 2019 the R&D Survey was conducted only for ...
2      3  Results for this category should be treated wi...
3      4  Includes a wide range of ANZSIC industry codes...
4      5  Based on Rolling Mean employment. See Datainfo...

In [5]:
dataset = pd.read_csv('C:/Users/Lenovo/Desktop/SAMPLE 1.csv')

In [6]:
dataset.head()

  Number                                           Footnote
0      1  Sector and published industry breakdowns accor...
1      2  In 2019 the R&D Survey was conducted only for ...
2      3  Results for this category should be treated wi...
3      4  Includes a wide range of ANZSIC industry codes...
4      5  Based on Rolling Mean employment. See Datainfo...

In [7]:
dataset = pd.read_csv('D:/ML/Sample datasets/Sample1.csv')

In [8]:
dataset.head()

   Sno  employment  price     gnp  armedforces
0    1       60323   83.0  234289         1590
1    2       61122   88.5  259426         1456
2    3       60171   88.2  258054         1616
3    4       61187   89.5  284599         1650
4    5       63221   96.2  328975         3099

In [9]:
df_1 = dataset.sort_values('armedforces',ascending=False)

In [10]:
dataset.head()

   Sno  employment  price     gnp  armedforces
0    1       60323   83.0  234289         1590
1    2       61122   88.5  259426         1456
2    3       60171   88.2  258054         1616
3    4       61187   89.5  284599         1650
4    5       63221   96.2  328975         3099

In [11]:
df_asc = dataset.sort_values('armedforces',ascending = True)

In [12]:
dataset.head()

   Sno  employment  price     gnp  armedforces
0    1       60323   83.0  234289         1590
1    2       61122   88.5  259426         1456
2    3       60171   88.2  258054         1616
3    4       61187   89.5  284599         1650
4    5       63221   96.2  328975         3099

In [13]:
df.head()

NameError: name 'df' is not defined

In [14]:
df_asc.head

<bound method NDFrame.head of     Sno  employment  price     gnp  armedforces
1     2       61122   88.5  259426         1456
0     1       60323   83.0  234289         1590
2     3       60171   88.2  258054         1616
3     4       61187   89.5  284599         1650
13   14       69564  114.2  502601         2514
12   13       68655  112.6  482704         2552
14   15       69331  115.7  518173         2572
11   12       66513  110.8  444546         2637
10   11       68169  108.4  442769         2798
15   16       70551  116.9  554894         2827
9    10       67857  104.6  419180         2857
8     9       66019  101.2  397469         3048
4     5       63221   96.2  328975         3099
7     8       63761  100.0  363112         3350
6     7       64989   99.0  365385         3547
5     6       63639   98.1  346999         3594>

In [15]:
df1.head()

NameError: name 'df1' is not defined

In [16]:
df_1.head()

   Sno  employment  price     gnp  armedforces
5    6       63639   98.1  346999         3594
6    7       64989   99.0  365385         3547
7    8       63761  100.0  363112         3350
4    5       63221   96.2  328975         3099
8    9       66019  101.2  397469         3048

In [17]:
df_1.to_csv('D:\ML\Sample datasets\Sample1_desc')

In [18]:
git init

SyntaxError: invalid syntax (2830201818.py, line 1)